# IFCGuidKey Constructor (String) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCGuidKey Constructor (String)
IFCGuidKey Class See Also
---
Constructs a new IFCHybridGuid
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public IFCGuidKey(
	string ifcGuid
)
```

Visual Basic
---
```text
Public Sub New ( _
	ifcGuid As String _
)
```

Visual C++
---
```text
public:
IFCGuidKey(
	String^ ifcGuid
)
```

# ### Parameters
ifcGuid
    Type: System..::..String IFC Global ID
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
IFCGuidKey Class
IFCGuidKey Overload
Autodesk.Revit.DB.IFC Namespace